Revit 2027 API
Form.DeleteProfile Method
Delete a profile of the form.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void DeleteProfile(
	int profileIndex
)
Public Sub DeleteProfile (
	profileIndex As Integer
)
public:
void DeleteProfile(
	int profileIndex
)
member DeleteProfile :
        profileIndex : int -> unit
Parameters
profileIndex Int32
Index to specify the profile.
See Also
Reference
Form Class
Autodesk.Revit.DB Namespace